Repository: rgt320q/TripBook
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Hello World!
tr: Merhaba Dünya!

source: Select Group Color:
tr: Grup Rengi Seçin:

source: Cancel
tr: İptal

source: Save
tr: Kaydet

# sortByNameAsc
source: By Name (A-Z)
tr: Ada Göre (A-Z)

# sortByNameDesc
source: By Name (Z-A)
tr: Ada Göre (Z-A)

# sortByDateNewest
source: By Date (Newest)
tr: Tarihe Göre (Yeni)

# sortByDateOldest
source: By Date (Oldest)
tr: Tarihe Göre (Eski)

# noGroupsYet
source: No groups created yet.
tr: Henüz bir grup oluşturulmamış.

source: Delete Group
tr: Grup Sil

# deleteGroupConfirmation
source: Are you sure you want to delete the group '{groupName}'? All locations belonging to this group will also be deleted.
tr: '{groupName}' grubunu silmek istediğinizden emin misiniz? Bu gruba ait tüm konumlar da silinecektir.

source: Delete
tr: Sil

source: Group Name
tr: Grup Adı

source: New Group
tr: Yeni Grup Oluştur

source: Edit Group
tr: Grup Düzenle

source: Select Group
tr: Grup Seç

source: TravelGroups
tr: Seyahat Grupları

# error
source: An error occurred: {error}
tr: Bir hata oluştu: {error}

# noLocationsInGroup
source: No locations in this group yet.
tr: Bu grupta henüz konum bulunmamaktadır.

# profileScreenTitle
source: User Profile
tr: Kullanıcı Profili

# profileEmailLabel
source: Email
tr: E-posta

# profileUsernameLabel
source: Username
tr: Kullanıcı Adı

# profileHomeLocationLabel
source: Home Location (Lat,Lng)
tr: Ev Konumu (Enlem,Boylam)

# profileLanguageLabel
source: Language
tr: Dil

# profileSaveSuccess
source: Profile updated!
tr: Profil güncellendi!

# profileLoadError
source: Could not load profile.
tr: Profil yüklenemedi.

# profileUsernameValidation
source: Please enter a username.
tr: Lütfen bir kullanıcı adı girin.

source: Create Route
tr: Rota Oluştur

source: Saved Routes
tr: Kaydedilmiş Rotalar

source: Reached Locations
tr: Ulaşılan Konumlar

source: Manage Locations
tr: Konumları Yönet

source: Manage Groups
tr: Grupları Yönet

source: Logout
tr: Çıkış Yap

source: Active Route Summary
tr: Aktif Rota Özeti

source: Clear Route
tr: Rotayı Temizle

# appTitle
source: Trip Book
tr: Seyahat Defteri

# createRouteDialogTitle
source: Create Route
tr: Rota Oluştur

# createRouteDialogContent
source: How would you like to create your route?
tr: Rotanızı nasıl oluşturmak istersiniz?

source: From Group
tr: Gruptan Seç

source: Manual Selection
tr: Manuel Seçim

# endPointDialogTitle
source: Endpoint
tr: Bitiş Noktası

# endPointDialogContent
source: The starting point is set as the endpoint. You can select a different endpoint from the map if you wish.
tr: Başlangıç noktası bitiş noktası olarak ayarlandı. Dilerseniz haritadan farklı bir bitiş noktası seçebilirsiniz.

source: Select from Map
tr: Haritadan Seç

source: Home location not set
tr: Ev konumu ayarlanmadı

# setHomeLocationTitle
source: Set Home Location
tr: Ev Konumunu Ayarla

# setHomeLocationContent
source: Do you want to set this location as your home?
tr: Bu konumu eviniz olarak ayarlamak ister misiniz?

source: Select Location
tr: Konum Seç

# continueButton
source: Continue
tr: Devam Et

# selectNewEndpoint
source: Please select a new endpoint from the map.
tr: Lütfen haritadan yeni bir bitiş noktası seçin.

# minTwoLocationsError
source: You must select at least 2 locations to create a route.
tr: Bir rota oluşturmak için en az 2 konum seçmelisiniz.

# locationsNotFoundError
source: The locations for this route could not be found or are insufficient.
tr: Bu rotadaki konumlar bulunamadı veya yetersiz.

# addLocationDialogTitle
source: Add New Location
tr: Yeni Konum Ekle

# realLocationNameLabel
source: Real Location Name (Cannot be changed)
tr: Gerçek Konum Adı (Değiştirilemez)

# customLocationNameLabel
source: Custom Name
tr: Özel Konum Adı

# descriptionLabel
source: Description
tr: Açıklama

# notesLabel
source: Private Notes
tr: Özel Notlar

# estimatedDurationLabel
source: Estimated Duration (minutes)
tr: Tahmini Süre (dakika)

# needsLabel
source: Needs (comma-separated)
tr: İhtiyaçlar (virgülle ayırın)

# selectGroupOptionalLabel
source: Select Group (Optional)
tr: Grup Seç (İsteğe Bağlı)

# confirmEndpointDialogTitle
source: Confirm Endpoint
tr: Bitiş Noktasını Onayla

# confirmEndpointDialogContent
source: Set '{geoName}' as the endpoint?
tr: '{geoName}' burası bitiş noktası olarak ayarlansın mı?

source: Confirm
tr: Onayla

source: Unknown Location
tr: Bilinmeyen Konum

# currentLocationError
source: Could not get current location. Please check location services.
tr: Mevcut konumunuz alınamadı. Lütfen konum servislerini kontrol edin.

# drawRouteError
source: Could not draw route. Check your API key or try again later.
tr: Rota çizilemedi. API anahtarınızı kontrol edin veya daha sonra tekrar deneyin.

# saveRouteDialogTitle
source: Save Route
tr: Rotayı Kaydet

# routeNameHint
source: Enter route name
tr: Rota adı girin

# routeExistsError
source: A route named '{routeName}' already exists. Overwrite?
tr: '{routeName}' isminde bir rota zaten var. Üzerine yazılsın mı?

source: Yes
tr: Evet

source: No
tr: Hayır

# routeSavedSuccess
source: Route saved as '{routeName}'
tr: Rota '{routeName}' olarak kaydedildi!

# routeCompletionDialogTitle
source: Route Completed
tr: Rota Tamamlandı

source: Planned Distance
tr: Planlanan Mesafe

source: Actual Distance
tr: Gerçekleşen Mesafe

source: Planned Total Duration
tr: Planlanan Toplam Süre

source: Actual Duration
tr: Gerçekleşen Süre

source: Exit
tr: Çık

# routeSummaryTitle
source: Route Summary
tr: Rota Özeti

# startNavigation
source: Start
tr: Başlat

source: Estimated Travel Time
tr: Tahmini Yol Süresi

source: Total Time at Stops
tr: Duraklardaki Toplam Süre

source: Total Trip Time
tr: Toplam Gezi Süresi

source: Total Distance
tr: Toplam Mesafe

# needsForTrip
source: Your needs for this trip:
tr: Bu gezi için ihtiyaçlarınız:

# notesForTrip
source: Your private notes for this trip:
tr: Bu gezi için aldığınız özel notlar:

# launchMapsError
source: Could not launch Google Maps.
tr: Google Haritalar uygulaması başlatılamadı.

# searchHint
source: Search...
tr: Ara...

# mapTypeTooltip
source: Map Type
tr: Harita Tipi

# resetBearingTooltip
source: Reset Bearing
tr: Kuzeyi Göster

# myLocationTooltip
source: Go to my location
tr: Konumuma Git

# manageLocationsScreenTitle
source: Manage Locations
tr: Konumları Yönet

# noSavedLocations
source: No saved locations found.
tr: Kaydedilmiş konum bulunamadı.

# groupNone
source: None
tr: Yok

# locationUpdatedSuccess
source: Location updated!
tr: Konum güncellendi!

# groupLabel
source: Group
tr: Grup

source: Show on Map
tr: Haritada Göster

source: Copy Location Info
tr: Konum Bilgisini Kopyala

# locationCopiedSuccess
source: Location info copied!
tr: Konum bilgileri kopyalandı!

source: Save Changes
tr: Değişiklikleri Kaydet

source: Delete Location
tr: Konumu Sil

# deleteLocationConfirmation
source: Are you sure you want to delete the location '{locationName}'?
tr: '{locationName}' konumunu silmek istediğinizden emin misiniz?

# locationDeletedSuccess
source: Location deleted.
tr: Konum silindi.

# googleMapsNameLabel
source: Google Maps Name:
tr: Google Haritalar Adı:

# logoutConfirmationTitle
source: Logout
tr: Çıkış Yap

# logoutConfirmationContent
source: Are you sure you want to logout?
tr: Çıkış yapmak istediğinizden emin misiniz?

source: Home Location
tr: Ev Konumu

source: Not Set
tr: Ayarlanmadı

source: Select Home Location
tr: Ev Konumunu Seç

source: End Location
tr: Bitiş Konumu

source: Home Location (Auto)
tr: Ev Konumu (Otomatik)

source: Current Location
tr: Mevcut Konum

# notificationSoundLabel
source: Timeout Notification Sound
tr: Zaman Aşımı Bildirim Sesi

# soundDefault
source: Default
tr: Varsayılan

# soundChime
source: Chime
tr: Çan Sesi

# soundAlert
source: Alert
tr: Uyarı

# soundNone
source: None
tr: Sessiz

# backgroundLocationNotificationText
source: TripBook is tracking your location in the background.
tr: TripBook, uygulama arka planda çalışırken konumunuzu takip ediyor.

# backgroundLocationNotificationTitle
source: TripBook Route Tracking
tr: TripBook Rota Takibi

source: Route completed!
tr: Rota tamamlandı!

# nearbyLocationNotificationTitle
source: You are near: {locationName}
tr: Yakınlardasınız: {locationName}

# nearbyLocationNotificationBody
source: Click to search for this location on Google!
tr: Konum için Google araması yapmak için tıklayın!

# timeExpiredNotificationTitle
source: Time's Up!
tr: Süreniz Doldu!

# timeExpiredNotificationBody
source: Your planned time at {locationName} has expired.
tr: {locationName} konumunda planladığınız süre doldu.

# minOneLocationError
source: You must select at least one location for the route.
tr: Rota için en az bir konum seçmelisiniz.

# notAvailable
source: N/A
tr: Mevcut Değil

# selectEndpointTitle
source: Select End Point
tr: Bitiş Noktasını Seç

source: Current End Point
tr: Mevcut Bitiş Noktası

source: Community Routes
tr: Topluluk Rotaları

# locationsNotFoundOrInsufficient
source: The locations for this route could not be found or are insufficient.
tr: Bu rotadaki konumlar bulunamadı veya yetersiz.

source: Selected End Point
tr: Seçilen Bitiş Noktası

source: Route start
tr: Rota başlangıcı

source: End Point
tr: Bitiş Noktası

source: Route end
tr: Rota bitişi

# routeExistsWarningTitle
source: Warning: Route Already Exists
tr: Uyarı: Rota Zaten Mevcut

# routeExistsWarningContent
source: You have already downloaded this route. Do you want to overwrite the existing version?
tr: Bu rotayı daha önce indirdiniz. Mevcut sürümün üzerine yazmak istiyor musunuz?

source: Overwrite
tr: Üzerine Yaz

# downloadRouteTitle
source: Download Route
tr: Rotayı İndir

# downloadRouteContent
source: Do you want to save the route '{routeName}' and all its locations to your own routes?
tr: '{routeName}' rotasını ve tüm konumlarını kendi rotalarınıza kaydetmek istiyor musunuz?

source: Download and View
tr: İndir ve Görüntüle

# routeUpdateSuccess
source: Route '{routeName}' was updated successfully!
tr: '{routeName}' rotası başarıyla güncellendi!

# routeDownloadError
source: An error occurred while downloading the route: {error}
tr: Rota indirilirken bir hata oluştu: {error}

# routeDetailsPlannedDistance
source: Planned Distance: {distance}
tr: Planlanan Mesafe: {distance}

# routeDetailsActualDistance
source: Actual Distance: {distance}
tr: Gerçekleşen Mesafe: {distance}

# routeDetailsPlannedTravelTime
source: Planned Travel Time: {time}
tr: Planlanan Yol Süresi: {time}

# routeDetailsPlannedStopTime
source: Planned Stop Time: {time}
tr: Planlanan Mola Süresi: {time}

# routeDetailsPlannedTotalTime
source: Planned Total Time: {time}
tr: Planlanan Toplam Süre: {time}

# routeDetailsActualTotalTime
source: Actual Total Time: {time}
tr: Gerçekleşen Toplam Süre: {time}

# needsListTitle
source: Needs List:
tr: İhtiyaç Listesi:

# privateNotesTitle
source: Private Notes:
tr: Özel Notlar:

source: Close
tr: Kapat

# noLocationsInThisRoute
source: No locations found in this route.
tr: Bu rotada konum bulunamadı.

source: Show Downloaded
tr: İndirilenleri Göster

source: Hide Downloaded
tr: İndirilenleri Gizle

# noSharedRoutes
source: No shared routes yet.
tr: Henüz paylaşılmış bir rota bulunmuyor.

# allRoutesDownloaded
source: All routes are downloaded and hidden.
tr: Tüm rotalar indirilmiş ve gizlenmiş.

# routeDistanceAndDuration
source: Distance: {distance} | Duration: {duration}
tr: Mesafe: {distance} | Süre: {duration}

# sharedBy
source: Shared by: {author}
tr: Paylaşan: {author}

# rating
source: {rating} ({count} votes)
tr: {rating} ({count} oy)

# comments
source: {count} comments
tr: {count} yorum

source: Downloading route...
tr: Rota indiriliyor...

source: Save Route
tr: Rotayı Kaydet

# saveRouteConfirmation
source: Are you sure you want to add the '{routeName}' route to your saved routes?
tr: '{routeName}' rotasını kendi kayıtlı rotalarınıza eklemek istediğinizden emin misiniz?

# routeSavedSuccessfully
source: '{routeName}' route saved successfully!
tr: '{routeName}' rotası başarıyla kaydedildi!

# unknownUser
source: Unknown
tr: Bilinmiyor

source: Distance
tr: Mesafe

source: Duration
tr: Süre

source: Total Break Time
tr: Toplam Mola Süresi

source: Rate
tr: Puanla

# commentsTitle
source: Comments
tr: Yorumlar

source: Draw Route
tr: Rotayı Çiz

source: Route Needs
tr: Rota İhtiyaçları

source: Route Notes
tr: Rota Notları

# addCommentHint
source: Add a comment...
tr: Yorum ekle...

# commentsLoadingError
source: Comments can't be loaded.
tr: Yorumlar yüklenemiyor.

# commentsLoadingErrorDescription
source: An error occurred while loading comments: {error}
tr: Yorumlar yüklenirken bir hata oluştu: {error}

source: No comments yet.
tr: Henüz yorum yapılmamış.

source: votes
tr: oy

source: Planned Travel Time
tr: Planlanan Yol Süresi

source: Planned Break Time
tr: Planlanan Mola Süresi

source: Planned Total Time
tr: Planlanan Toplam Süre

source: Actual Total Time
tr: Gerçekleşen Toplam Süre

source: Needs List
tr: İhtiyaç Listesi

source: Private Notes
tr: Özel Notlar

source: Start
tr: Başlat

# noLocationsInRoute
source: No locations in this route.
tr: Bu rotada konum bulunamadı.

# privateNotesLabel
source: Private Notes
tr: Özel Notlar

# estimatedStayTimeLabel
source: Estimated Stay Time (minutes)
tr: Tahmini Kalma Süresi (dakika)

# enterValidNumberError
source: Please enter a valid number.
tr: Lütfen geçerli bir sayı girin.

# needsListLabel
source: Needs List
tr: İhtiyaç Listesi

# addNewNeedHint
source: Add new need
tr: Yeni ihtiyaç ekle

source: Sort and Edit
tr: Sırala ve Düzenle

# endLocationLabel
source: End Location
tr: Bitiş Konumu

source: Change
tr: Değiştir

# latitude
source: Lat
tr: Enlem

# longitude
source: Lon
tr: Boylam

source: Reached Locations Log
tr: Ulaşılan Konumlar Günlüğü

source: Mark All as Read
tr: Tümünü Okundu İşaretle

source: All logs marked as read.
tr: Tüm günlükler okundu olarak işaretlendi.

source: Select All
tr: Tümünü Seç

source: Unselect All
tr: Tüm Seçimi Kaldır

source: All logs marked as unread.
tr: Tüm günlükler okunmadı olarak işaretlendi.

source: Delete Read
tr: Okunanları Sil

# readLogsDeleted
source: All read logs have been deleted.
tr: Okunan tüm kayıtlar silindi.

# sortByDateNew
source: By Date (Newest)
tr: Tarihe Göre (Yeni)

# sortByDateOld
source: By Date (Oldest)
tr: Tarihe Göre (Eski)

# noReachedLocations
source: You haven't reached any locations yet. They will be added here as you approach them on a route.
tr: Henüz bir konuma ulaşmadınız. Bir rota başlatıp hedeflere yaklaştığınızda buraya eklenecektir.

source: Reached At
tr: Ulaşılma

source: More Info
tr: Daha Fazla Bilgi

source: Stop Sharing
tr: Paylaşımı Durdur

source: Share Route
tr: Rotayı Paylaş

# stopSharingConfirmation
source: Are you sure you want to stop sharing the route '{routeName}' with the community?
tr: Paylaşım kaldırıldığında, rota ile ilgili tüm bilgiler (puanlar, yorumlar vb.) silinecektir. '{routeName}' rotasının toplulukla paylaşımını durdurmak istediğinizden emin misiniz?

# shareRouteConfirmation
source: Are you sure you want to share the route '{routeName}' with other users? The route will appear on the community screen.
tr: '{routeName}' rotasını diğer kullanıcılarla paylaşmak istediğinizden emin misiniz? Rota, topluluk ekranında görünecektir.

# routeNoLongerShared
source: '{routeName}' route is no longer shared.
tr: '{routeName}' rotası artık paylaşılmıyor.

# routeSharedSuccessfully
source: '{routeName}' route shared successfully!
tr: '{routeName}' rotası başarıyla paylaşıldı!

source: Delete Route
tr: Rotayı Sil

# deleteRouteConfirmation
source: Are you sure you want to delete the route named '{routeName}'?
tr: '{routeName}' adlı rotayı silmek istediğinizden emin misiniz?

# deleteLabel
source: Delete
tr: Sil

# routeDeleted
source: '{routeName}' route has been deleted.
tr: '{routeName}' rotası silindi.

# noSavedRoutes
source: No saved routes found.
tr: Kaydedilmiş rota bulunamadı.

# errorOccurred
source: An error occurred: {error}
tr: Bir hata oluştu: {error}

# distanceLabel
source: Distance
tr: Mesafe

# durationLabel
source: Duration
tr: Süre

# languageEnglish
source: English
tr: İngilizce

# languageTurkish
source: Turkish
tr: Türkçe

# languageCode
source: en
tr: tr

source: Language
tr: Dil

source: Login
tr: Giriş Yap

source: Sign Up
tr: Kayıt Ol

source: Email Address
tr: E-posta Adresi

source: Password
tr: Şifre

source: Create new account
tr: Yeni hesap oluştur

# alreadyHaveAccount
source: I already have an account
tr: Zaten bir hesabım var

# enterValidEmail
source: Please enter a valid email address.
tr: Lütfen geçerli bir e-posta adresi girin.

# routeAlreadySaved
source: This route is already saved.
tr: Bu rota zaten kayıtlı.

source: (Downloaded from community)
tr: (Topluluktan indirildi)

# deleteRouteConfirmationWithLocations
source: This route was downloaded from the community. Do you want to delete the associated locations as well?
tr: Bu rota topluluktan indirildi. İlişkili konumları da silmek istiyor musunuz?

# locationsLabel
source: Locations
tr: Konumlar

source: Delete Route and Locations
tr: Rotayı ve Konumları Sil
